/*
  String_ui.strings
  iina

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
// Common

"general.on" = "चालू";
"general.off" = "बंद";
"general.login" = "लॉग इन";
"general.logout" = "लोग आउट";
"general.ok" = "ठीक";
"general.cancel" = "रद्द";
"general.username" = "उपयोगकर्ता नाम";
"general.password" = "पारण शब्द";
"general.na" = "N/A";

"input.value_is_empty" = "मान रिक्त नहीं हो सकता ।";
"input.already_exists" = "वैल्यू पहले से मौजूद है|";

// Guide Window
"guide.highlights" = "हाइलाइट";
"guide.basic_settings" = "मार्गदर्शक. मूल_सेटिंग्स";
"guide.faq" = "अक्सर पूछे जाने वाले प्रश्न";

// Initial Window
"initial.announcement" = "आप IINA का %@ संस्करण उपयोग कर रहे हैं";
"initial.beta.desc" = "अगर आप रिलीज़ संस्करण पर वापस जाना चाहते हैं, तो सेटिंग्स > सामान्य से \"बीटा अपडेट प्राप्त करें\" को अनचेक करें और हमारी <a href=\"https://iina.io\">आधिकारिक वेबसाइट</a> से एक स्थिर रिलीज़ इंस्टॉल करें।";
"initial.nightly.desc" = "रोज़मर्रा के उपयोग के लिए नाइटली का इस्तेमाल करने की सिफारिश नहीं की जाती। फिलहाल, नाइटली बिल्ड ऑटो अपडेट को सपोर्ट नहीं करते हैं। कृपया हमारी <a href=\"https://nightly.iina.io\">नाइटली वेबसाइट</a> से नए बिल्ड मैन्युअल रूप से डाउनलोड करें।";
"initial.debug.desc" = "डीबग बिल्ड आमतौर पर परफॉर्मेंस के लिए ऑप्टिमाइज़ नहीं होते हैं, इसलिए उन्हें रोज़मर्रा के उपयोग के लिए इस्तेमाल करने की सिफारिश नहीं की जाती। डीबग बिल्ड ऑटो अपडेट को सपोर्ट नहीं करते हैं।";
"initial.bug_report" = "<a href=\"https://github.com/iina/iina/issues\">गिटहब इश्यूज़</a> पर रिपोर्ट करें।";

// Inspector Window
"inspector.error" = "त्रुटि";

// MainWindowController.swift
"main.buffering_indicator" = "बफरिंग… %d%%";
"main.opening_stream" = "खुलने की धारा…";
"main.seeking_indicator" = "सीकिंग…";
"osc.precision" = "सटीकता";
"osc.1s" = "1 सेकंड";
"osc.100ms" = "100 मिलीसेकंड";
"osc.10ms" = "10 मिलीसेकंड";
"osc.1ms" = "1 मिलीसेकंड";

// QuickSettingViewController.swift
"quicksetting.item_default" = "डिफ़ॉल्ट";
"quicksetting.item_none" = "कोई नहीं";
"quicksetting.hwdec" = "हार्डवेयर डिकोडिंग";
"quicksetting.deinterlace" = "असंग्रथित";
"quicksetting.hdr" = "एचडीआर";
"quicksetting.hide" = "छिपाना";
"quicksetting.reset_speed" = "स्पीड को 1x पर रीसेट करें";

// EQ Presets
"eq.preset.flat" = "फ़्लैट";
"eq.preset.acoustic" = "अकॉस्टिक";
"eq.preset.classical" = "शास्त्रीय";
"eq.preset.dance" = "नृत्य";
"eq.preset.deep" = "गहरा";
"eq.preset.electronic" = "इलेक्ट्रॉनिक";
"eq.preset.hip_hop" = "हिप हॉप";
"eq.preset.increase_bass" = "बास बढ़ाएँ";
"eq.preset.increase_treble" = "ट्रेबल बढ़ाएँ";
"eq.preset.increase_vocal" = "वोकल बढ़ाएँ";
"eq.preset.jazz" = "जैज़";
"eq.preset.latin" = "लैटिन";
"eq.preset.loundness" = "लाउडनेस";
"eq.preset.lounge" = "लाउंज";
"eq.preset.piano" = "पियानो";
"eq.preset.pop" = "पॉप";
"eq.preset.rnb" = "आर एंड बी";
"eq.preset.reduce_bass" = "बास कम करें";
"eq.preset.reduce_treble" = "ट्रेबल कम करें";
"eq.preset.rock" = "रॉक";
"eq.preset.small_speaker" = "छोटा स्पीकर";
"eq.preset.spoken_word" = "स्पोकन वर्ड";

"alert.eq.new_profile.title" = "नया ईक्यू प्रोफ़ाइल";
"alert.eq.new_profile.message" = "कृपया एक प्रोफ़ाइल नाम दर्ज करें।";
"alert.eq.rename.title" = "वर्तमान प्रोफ़ाइल का नाम बदलें";
"alert.eq.rename.message" = "कृपया एक नया प्रोफ़ाइल नाम दर्ज करें।";

// OSDMessage.swift
"osd.pause" = "रोकें";
"osd.resume" = "पुनः आरंभ";
"osd.volume" = "ध्वनि: %@";
"osd.speed" = "गति: %@x";
"osd.aspect" = "आस्पेक्ट अनुपात: %@";
"osd.crop" = "क्रॉप: %@";
"osd.rotate" = "घुमाएँ: %i°";
"osd.deinterlace" = "डीइंटरलेस: %@";
"osd.hwdec" = "हार्डवेयर डिकोडिंग: %@";
"osd.audio_delay.nodelay" = "ऑडियो विलंब: विलंब न करें";
"osd.audio_delay.later" = "ऑडियो विलंब: %@s बाद में";
"osd.audio_delay.earlier" = "ऑडियो विलंब: %@s पूर्व";
"osd.sub_delay.nodelay" = "उपशीर्षक देरी: विलंब न करें";
"osd.sub_delay.later" = "उपशीर्षक देरी: %@s बाद में";
"osd.sub_delay.earlier" = "उपशीर्षक देरी: %@s पूर्व";
"osd.subtitle_pos" = "उपशीर्षक पद: %@";
"osd.sub_hidden" = "सबटाइटल्स छिपाए गए हैं";
"osd.sub_visible" = "सबटाइटल्स दिखाई दे रहे हैं";
"osd.sub_second_delay.nodelay" = "सेकंडरी सबटाइटल डिले: कोई डिले नहीं";
"osd.sub_second_delay.later" = "सेकंडरी सबटाइटल डिले: %@ सेकंड बाद";
"osd.sub_second_delay.earlier" = "Secondary Subtitle Delay: %@s Earlier";
"osd.sub_second_hidden" = "Secondary Subtitles Hidden";
"osd.sub_second_pos" = "Secondary Subtitle Position: %@";
"osd.sub_second_visible" = "Secondary Subtitles Visible";
"osd.mute" = "म्यूट";
"osd.unmute" = "Unmute";
"osd.screenshot" = "स्क्रीनशॉट कैप्चर किया गया";
"osd.abloop.a" = "AB-लूप: A";
"osd.abloop.b" = "AB-लूप: B";
"osd.abloop.clear" = "AB-लूप: साफ़ किया गया";
"osd.stop" = "रुकें";
"osd.chapter" = "अध्याय: %@";
"osd.subtitle_scale" = "उपशीर्षक स्केल: %@x";
"osd.add_to_playlist" = " प्लेलिस्ट में %i फ़ाइलें जोड़ी गईं";
"osd.clear_playlist" = "क्लीयर प्लेलिस्ट";
"osd.video_eq.contrast" = "कन्ट्रास्ट: %i";
"osd.video_eq.gamma" = "गामा: %i";
"osd.video_eq.hue" = "रंग: %i";
"osd.video_eq.saturation" = "संतृप्ति: %i";
"osd.video_eq.brightness" = "चमक: %i";
"osd.find_online_sub" = "ऑनलाइन उपशीर्षक ढूँढना…";
"osd.find_online_sub.source" = "from";
"osd.sub_not_found" = "कोई उपशीर्षक नहीं मिला";
"osd.sub_found" = "%d subtitles found.";
"osd.sub_downloading" = "Downloading %d subtitles";
"osd.sub_downloaded" = "उपशीर्षक डाउनलोड किया गया";
"osd.sub_saved" = "उपशीर्षक सहेजा गया";
"osd.network_error" = "नेटवर्क त्रुटि";
"osd.file_error" = "फ़ाइल पढ़ने में त्रुटि";
"osd.cannot_login" = "लॉग इन नहीं कर सकता";
"osd.canceled" = "रद्द";
"osd.cannot_connect" = "Cannot connect";
"osd.timed_out" = "Timed Out";
"osd.filter_added" = "जोड़ा गया फ़िल्टर: %@";
"osd.filter_removed" = "फ़िल्टर हटाया गया";
"osd.file_loop" = "Loop Single File";
"osd.playlist_loop" = "Loop Playlist";
"osd.no_loop" = "Disable Looping";

"preference.title" = "पसंद";
"preference.general" = "सामान्य";
"preference.ui" = "यूआई";
"preference.video_audio" = "वीडियो/ऑडियो";
"preference.subtitle" = "उपशीर्षक";
"preference.network" = "नेटवर्क";
"preference.control" = "नियंत्रण";
"preference.keybindings" = "कुंजी बाइंडिंग";
"preference.advanced" = "उन्नत";
"preference.plugins" = "Plugins";
"preference.utilities" = "उपयोगिताएँ";
"preference.scripts" = "स्क्रिप्ट";
"preference.not_logged_in" = "लोग इन नहीं है";
"preference.logged_in_as" = "%@ के रूप में लॉग इन किया";
"preference.system_media_control" = "सिस्टम मीडिया नियंत्रण का उपयोग करें";

"preference.key_binding_hint_1" = "वर्तमान कॉन्फ़िगरेशन फ़ाइल में मुख्य बाइंडिंग को संपादित करने के लिए, प्रतिलिपि बनाने के लिए सबसे पहले \"डुप्लीकेट…\" बटन पर क्लिक करें।";
"preference.key_binding_hint_2" = "संबंधित कुंजी बंधन को संपादित करने के लिए दाईं ओर एक पंक्ति पर डबल क्लिक करें।";

"preference.enable_adv_settings" = "उन्नत सेटिंग्स सक्षम करें";

"preference.sub_override_level.no" = "no";
"preference.sub_override_level.force" = "force";
"preference.sub_override_level.scale" = "scale";
"preference.sub_override_level.strip" = "स्ट्रिप";
"preference.sub_override_level.yes" = "yes";

"preference.sub_override_level.descriptive_text.no" = "Render subtitles as specified by the subtitle scripts, without overrides.";
"preference.sub_override_level.descriptive_text.force" = "Apply all subtitle styles.";
"preference.sub_override_level.descriptive_text.scale" = "Apply the scale setting in addition to the style settings in this section.";
"preference.sub_override_level.descriptive_text.strip" = "Radically strip all ASS tags and styles from the subtitle.";
"preference.sub_override_level.descriptive_text.yes" = "Apply all the style settings in this section.";

"preference.ytdl_plugin_not_installed" = "Install the Online Media plugin from \"Plugins > Install from GitHub\" to enjoy advanced features such and video downloading and auto yt-dlp updates.";
"preference.ytdl_plugin_installed" = "The built-in youtube-dl support is disabled since you have the Online media plugin installed.";

"menu.volume" = "ध्वनि: %@";
"menu.volume_muted" = "Volume: %@ (Muted)";
"menu.audio_delay" = "ऑडियो विलंब: %@s";
"menu.sub_delay" = "उपशीर्षक देरी: %@s";
"menu.sub_hide" = "Hide Subtitles";
"menu.sub_show" = "Show Subtitles";
"menu.sub_second_hide" = "Hide Secondary Subtitles";
"menu.sub_second_show" = "Show Secondary Subtitles";
"menu.fullscreen" = "पूर्ण स्क्रीन दर्ज करें";
"menu.exit_fullscreen" = "पूर्ण स्क्रीन से बाहर निकलें";
"menu.pip" = "पिक्चर-इन-पिक्चर डालें";
"menu.exit_pip" = "पिक्चर-इन-पिक्चर से बाहर निकलें";
"menu.mini_player" = "Enter Music Mode";
"menu.exit_mini_player" = "Exit Music Mode";
"menu.pause" = "रोकें";
"menu.resume" = "पुनः आरंभ";
"menu.speed" = "गति: %@x";
"menu.chapters" = "अध्याय पैनल दिखाएं";
"menu.hide_chapters" = "Hide Chapters Panel";
"menu.playlist" = "प्लेलिस्ट पैनल दिखाएं";
"menu.hide_playlist" = "Hide Playlist Panel";
"menu.video" = "Show Video Panel";
"menu.hide_video" = "Hide Video Panel";
"menu.audio" = "Show Audio Panel";
"menu.hide_audio" = "Hide Audio Panel";
"menu.subtitles" = "Show Subtitles Panel";
"menu.hide_subtitles" = "Hide Subtitles Panel";

"menu.seek_forward" = "आगे कदम %@s";
"menu.seek_backward" = "पीछे जाओ %@s";
"menu.speed_up" = "Speed Up by %@x";
"menu.speed_down" = "Speed Down by %@x";
"menu.volume_up" = "ध्वनि + %@%%";
"menu.volume_down" = "ध्वनि - %@%%";
"menu.audio_delay_up" = "ऑडियो विलंब + %@s";
"menu.audio_delay_down" = "ऑडियो विलंब - %@s";
"menu.sub_delay_up" = "उपशीर्षक देरी + %@s";
"menu.sub_delay_down" = "उपशीर्षक देरी - %@s";

"menu.crop_custom" = "कस्टम…";
"menu.find_online_sub" = "Find Online Subtitles from %@";

"menu.manage_plugins" = "Manage Plugins…";
"menu.developer_tool" = "Developer Tool";
"menu.more_plugin" = "More…";
"menu.conflicting_shortcuts" = "Conflicting key shortcuts…";
"menu.reload_plugins" = "Reload All Plugins";
"menu.show_plugins_panel" = "Show Plugins Panel";
"menu.hide_plugins_panel" = "Hide Plugins Panel";

"track.audio" = "ऑडियो";
"track.none" = "<कोई नहीं>";
"track.sub" = "उपशीर्षक";
"track.video" = "वीडियो";

"subtrack.no_loaded" = "कोई उपशीर्षक लोड नहीं हुआ";
"subtrack.no_external" = "कोई बाहरी उपशीर्षक नहीं मिला";

// Alerts
"alert.beta_channel.title" = "बीटा संस्करणों के लिए अपडेट प्राप्त करें";

"alert.title_error" = "त्रुटि";
"alert.title_warning" = "चेतावनी";
"alert.title_info" = "जानकारी";

"alert.fatal_error" = "घातक त्रुटि: %@ \n एप्लिकेशन अब बाहर निकल जाएगा।";
"alert.mpv_error" = "आंतरिक गलती %@ (%@) विकल्प सेट करते समय %@।";

"alert.unsupported_audio" = "असमर्थित बाहरी ऑडियो फ़ाइल।";
"alert.unsupported_video" = "Unsupported external video file.";
"alert.unsupported_sub" = "असमर्थित बाहरी उपशीर्षक।";
"alert.unsupported_url" = "असमर्थित यूआरएल।";
"alert.wrong_url_format" = "गलत यूआरएल प्रारूप।";

"alert.error_open" = "फ़ाइल या स्ट्रीम नहीं खोल सकता!";
"alert.error_finding_file" = "%@ फ़ाइल नहीं मिल रही है!";
"alert.error_loading_script" = "स्क्रिप्ट %@! लोड नहीं किया जा सकता";
"alert.error_saving_file" = "%@: %@ को सहेजते समय त्रुटि आई\n";
"alert.error_deleting_file" = "फ़ाइल को हटा नहीं सकता।";

"alert.target_peak.bad_value" = "The value \"%@\" is invalid.\nPlease provide a value between 10 and 10000, or 0.";

"alert.config.new.title" = "नया इनपुट कॉन्फ़िगरेशन";
"alert.config.new.message" = "कृपया नए कॉन्फ़िगरेशन के लिए एक नाम दर्ज करें।";
"alert.config.duplicate.title" = "डुप्लिकेट कॉन्फ़िगरेशन";
"alert.config.duplicate.message" = "कृपया डुप्लिकेट कॉन्फ़िगरेशन फ़ाइल के लिए नाम दर्ज करें।";
"alert.config.file_existing.title" = "फ़ाइल पहले से ही मौजूद है";
"alert.config.file_existing.message" = "A config file with the same filename already exists. Choose OK to show the file in Finder.";
"alert.config.cannot_create" = "कॉन्फ़िगरेशन फ़ाइल नहीं बना सकता है!\n%@";
"alert.config.cannot_write" = "फ़ाइल को कॉन्फ़िगर करने के लिए नहीं लिख सकता!";
"alert.config.rename.title" = "Rename Input Configuration";
"alert.config.rename.message" = "Please enter the new name for the configuration.";

"alert.filter.incorrect" = "फ़िल्टर सेट करते समय त्रुटि आई। कृपया अपना पैरामीटर प्रारूप जांचें।";
"alert.add_filter.title" = "नया फ़िल्टर";
"alert.add_filter.message" = "कृपया mpv के vf या af कमांड के प्रारूप में एक फिल्टर स्ट्रिंग दर्ज करें।";

"alert.keybinding_config.error" = "कीबाइंडिंग कॉन्फ़िगरेशन फ़ाइल पार्स करने में त्रुटि \"%@\"! IINA डिफ़ॉल्ट कीबाइंडिंग सेटिंग में गिरावट। कृपया अपना कॉन्फ़िगरेशन जांचें।";

"alert.extra_option.cannot_read" = "अतिरिक्त परिभाषित एमपीवी विकल्पों को उपयोगकर्ता पढ़ नहीं सकता।";
"alert.extra_option.empty" = "कुंजी या मान रिक्त नहीं हो सकता!";
"alert.extra_option.error" = "रिटर्न सेटिंग %d के साथ विकल्प --%@=%@ को सेट करने में त्रुटि। कृपया वरीयता> उन्नत में अपनी अतिरिक्त विकल्प सेटिंग्स की जाँच करें।";
"alert.extra_option.config_folder" = "कॉन्फ़िगरेशन निर्देशिका को सेट करने में त्रुटि \"%@\".";

"alert.playlist.error_deleting" = "हटाने में त्रुटि: %@";

"alert.screenshot.error_taking" = "Cannot take a screenshot!";

"alert.sub.no_selected" = "कृपया पहले डाउनलोड किए गए उपशीर्षक का चयन करें।";
"alert.sub_lang_not_set" = "OpenSubtitles का उपयोग करने से पहले वरीयताओं को पसंदीदा उपशीर्षक भाषाओं में सेट करें। इस बार अंग्रेजी (संलग्न) का उपयोग किया जाएगा।";
"alert.sub.cannot_save_passwd" = "किचेन में अपना पासवर्ड नहीं सहेज सकता: %@";
"alert.sub.cannot_login" = "लॉग इन नहीं कर सकता। कृपया अपना उपयोगकर्ता नाम, पासवर्ड और नेटवर्क स्थिति जांचें। \n\n%@";
"alert.sub.save_downloaded.title" = "डाउनलोड किए गए उपशीर्षक को सहेजें";

"alert.set_default.title" = "डिफ़ॉल्ट ऐप के रूप में IINA की स्थापना";
"alert.set_default.message" = "IINA सभी फ़ाइल प्रकारों के लिए डिफ़ॉल्ट ऐप के रूप में सेट किया जाएगा जो इसका समर्थन करता है।";
"alert.set_default.success" = "%d सफलता के साथ समाप्त हुआ और %d विफल रहा।";

"alert.add_watch.title" = "वॉच प्रॉपर्टी जोड़ें";
"alert.add_watch.message" = "कृपया एक मान्य mpv गुण नाम दर्ज करें।";

"alert.jump_to.title" = "पर कूदना";
"alert.jump_to.message" = "कृपया उस समय को दर्ज करें जिसमें आप कूदना चाहते हैं। उदाहरण: 20:35";

"alert.opensub.login.title" = "OpenSubtitles लॉगिन करें";
"alert.opensub.login.message" = "कृपया अपना यूज़रनेम और पासवर्ड दर्ज करें";

"alert.open_url.title" = "यूआरएल खोलें";
"alert.open_url.message" = "कृपया यहां यूआरएल दर्ज करें:";
"alert.choose_media_file.title" = "मीडिया फ़ाइलें चुनें";

"alert.add_url.title" = "यूआरएल जोड़िये";
"alert.add_url.message" = "कृपया यहां यूआरएल दर्ज करें:";

"alert.delete_history.title" = "प्लेबैक इतिहास हटाएं";
"alert.delete_history.message" = "क्या आप चयनित प्रविष्टियों को हटाना सुनिश्चित करते हैं?";

"alert.filter_hwdec.message" = "आप एक वीडियो फ़्लिटर लागू करने वाले हैं। हालाँकि, आपका वर्तमान हार्डवेयर डिकोडर अच्छी तरह से वीडियो फिल्टर का समर्थन नहीं कर सकता है। आप या तो हार्डवेयर डिकोडिंग को अक्षम कर सकते हैं या ऑटो (कॉपी) पर स्विच कर सकते हैं, जो मेमोरी का दोगुना उपभोग करेगा।\nआपको इसे काम करने के लिए पिछला ऑपरेशन (जैसे फसल सेट करना) दोहराना पड़ सकता है।";
"alert.filter_hwdec.abort" = "निरस्त करें";
"alert.filter_hwdec.turn_off" = "हार्डवेयर डिकोडिंग को बंद करें";
"alert.filter_hwdec.use_copy" = "ऑटो पर स्विच करें (कॉपी करें)";

"alert.clear_cache.title" = "स्पष्ट थंबनेल कैश";
"alert.clear_cache.message" = "क्या आप सभी थंबनेल कैश को साफ़ करना चाहते हैं?";

"alert.clear_history.title" = "प्लेबैक इतिहास मिटा दें";
"alert.clear_history.message" = "क्या आप सभी प्लेबैक इतिहास हटाना चाहते हैं?";

"alert.clear_watch_later.title" = "स्पष्ट प्लेबैक प्रगति को बचाया";
"alert.clear_watch_later.message" = "क्या आप सभी सहेजे गए प्लेबैक प्रगति (\"बाद में देखना\" डेटा) को हटाना सुनिश्चित कर रहे हैं?";

"alert.restore_alerts.title" = "Restore Suppressed Alerts";
"alert.restore_alerts.message" = "Are you sure you want to restore suppressed alerts?";

"alert.nothing_to_open" = "कुछ भी नहीं खोलने के लिए।";

"alert.no_video_track" = "कोई वीडियो ट्रैक नहीं है।";

"alert.duplicate_config" = "आप डिफ़ॉल्ट कॉन्फ़िगरेशन को सीधे संपादित नहीं कर सकते। कृपया संपादन से पहले एक डुप्लिकेट करें।";

"alert.assrt_register" = "सीमित एपीआई कोटा के कारण, आपको अपने स्वयं के एपीआई टोकन का उपयोग करने की दृढ़ता से अनुशंसा की जाती है। डिफ़ॉल्ट टोकन केवल डेमो उपयोग के लिए है, और आप नेटवर्क त्रुटि का सामना कर सकते हैं।";
"alert.assrt_register.register" = "अभी पंजीकरण करें";
"alert.assrt_register.try" = "पहले प्रयास करें";
"alert.assrt_token_prompt.title" = "अपना API टोकन दर्ज करें";
"alert.assrt_token_prompt.message" = "कृपया खुले हुए वेबपेज में पंजीकरण करें। अपने उपयोगकर्ता मुख पृष्ठ में अपना टोकन प्राप्त करें और इसे नीचे दर्ज करें:";
"alert.assrt_token_invalid" = "आपका Assrt API टोकन अमान्य लगता है।";

"alert.plugin_uninstall.title" = "Are you sure to uninstall %@?";
"alert.plugin_uninstall.message" = "The plugin will be deleted from your disk.";
"alert.plugin_reinstall.title" = "Plugin %@ already exists";
"alert.plugin_reinstall.message" = "Do you want to reinstall the plugin?";
"alert.duplicated_plugin_id" = "Duplicated plugin identifiers detected. Two or more plugins have the same identifier \"%@\". This may cause abnormal behaviors. Please find them in Preferences - Plugins and report to their authors. If a plugin is installed locally, you can also manually change its identifier in the plugin's Info.json file.";
"alert.plugin_no_update" = "No update found.";
"alert.plugin_update_found.title" = "Update found for %@";
"alert.plugin_update_found.message" = "The latest version is %@. You have %@. Would you like to update?";
"alert.plugin_permission" = "This plugin requires the following permissions. Please review them before proceeding.";
"alert.plugin_permission_added" = "This update requires additional permissions. Please review them before proceeding.";

"playlist.total_length" = "कुल %@";
"playlist.total_length_with_selected" = "%@ में से %@ का चयन किया गया ";
"playlist.sorting.header" = "Sorting";
"playlist.sorting.filename_ascending" = "Filename Ascending";
"playlist.sorting.filename_descending" = "Filename Descending";
"playlist.sorting.path_ascending" = "File Path Ascending";
"playlist.sorting.path_descending" = "File Path Descending";
"pl_menu.title_multi" = "%d आइटम";
"pl_menu.play_next" = "आगे चलाएं";
"pl_menu.play_in_new_window" = "नई विंडो में चलाएं";
"pl_menu.remove" = "हटाना";
"pl_menu.remove_multi" = "चुना हुआ हटाओ";
"pl_menu.delete" = "ट्रैश में डालें";
"pl_menu.delete_multi" = "चयनित फ़ाइलों को ट्रैश में ले जाएं";
"pl_menu.delete_after_play" = "प्लेबैक के बाद ट्रैश में जाएं";
"pl_menu.delete_after_play_multi" = "प्लेबैक के बाद ट्रैश में चयनित फ़ाइलों को स्थानांतरित करें";
"pl_menu.show_in_finder" = "खोजक में पता चलता है";
"pl_menu.add_file" = "फाइल जोडें…";
"pl_menu.add_url" = "यू आर एल जोड़िये…";
"pl_menu.clear_playlist" = "क्लियर प्लेलिस्ट";
"pl_menu.matched_sub" = "मेल खाने वाले %d उपशीर्षक(रों)";
"pl_menu.add_sub" = "उपशीर्षक जोड़ें…";
"pl_menu.wrong_sub" = "गलत उपशीर्षक!";
"pl_menu.browser" = "ब्राउज़र में खोलें";
"pl_menu.copy_url" = "यूआरएल कॉपी करें";
"pl_menu.copy_url_multi" = "सारे यूआरएल कॉपी करें";

"keymapping.title" = "कुंजी मानचित्रण";
"keymapping.message" = "रिकॉर्ड करने के लिए कोई भी कुंजी दबाएँ।";

"filter.video_filters" = "वीडियो फिल्टर";
"filter.audio_filters" = "ऑडियो फिल्टर";

"hwdec.no" = "हार्डवेयर डिकोडिंग अक्षम करें।";
"hwdec.auto" = "हार्डवेयर डिकोडिंग सक्षम करें। हालाँकि, अधिकांश वीडियो फ़िल्टर ठीक से काम नहीं करेंगे।";
"hwdec.auto-copy" = "हार्डवेयर डिकोडिंग सक्षम करें। यह मेमोरी को दोगुना कर देगा लेकिन वीडियो फिल्टर के साथ काम करेगा।";

"gaplessAudio.no" = "Playback of consecutive audio files may result in silence or disruption at the point of file change.";
"gaplessAudio.weak" = "If the audio format the decoder output changes, the audio device is closed and reopened, disrupting gapless playback.";
"gaplessAudio.yes" = "The audio device is opened using parameters chosen for the first file played and is then kept open for gapless playback. Following files may be resampled.";

"subencoding.auto" = "स्वयं पता लगाना";

"osc_toolbar.settings" = "शीग्र सेटिंग्स";
"osc_toolbar.playlist" = "प्लेलिस्ट और अध्याय";
"osc_toolbar.pip" = "टॉगल पिक्चर-इन-पिक्चर";
"osc_toolbar.full_screen" = "पूर्णस्क्रीन चालू करें";
"osc_toolbar.music_mode" = "संगीत मोड दर्ज करें";
"osc_toolbar.sub_track" = "उपशीर्षक ट्रैक चुनें";
"osc_toolbar.screenshot" = "Take a screenshot";
"osc_toolbar.plugins" = "Show plugins panel";

"mini_player.album_art" = "Toggle album art";
"mini_player.loop" = "Repeat";
"mini_player.shuffle" = "फेंटना";
"mini_player.remove" = "Remove from playlist";
"mini_player.add" = "Add to playlist";
"mini_player.delete" = "Delete all tracks from playlist";
"mini_player.volume" = "ध्वनि";
"mini_player.close" = "Close music mode";
"mini_player.back" = "Return to video mode";
"mini_player.sort" = "Sort the playlist";

// Touch bar

"touchbar.ahead_15" = "15 सेकेंड आगे";
"touchbar.ahead_30" = "30 सेकेंड आगे";
"touchbar.back_15" = "15 सेकेंड पीछे";
"touchbar.back_30" = "30 सेकेंड पीछे";
"touchbar.next_video" = "अगला वीडियो";
"touchbar.prev_video" = "पिछला वीडियो";
"touchbar.increase_volume" = "ध्वनि +";
"touchbar.decrease_volume" = "ध्वनि -";
"touchbar.rewind" = "रिवाइंड";
"touchbar.fast_forward" = "तेजी से आगे बढ़ना";
"touchbar.play_pause" = "चलाएं / ठहरें";
"touchbar.seek" = "खोजना";
"touchbar.time" = "समय की स्थिति";
"touchbar.remainingTimeOrTotalDuration" = "Remaining Time / Total Duration";
"touchbar.toggle_pip" = "टॉगल पिक्चर-इन-पिक्चर";

// Plugin permissions

"permissions.network-request.name" = "Network Request";
"permissions.network-request.desc" = "This plugin can make requsts from or upload data to these websites:";
"permissions.network-request.any_site" = "Any site";
"permissions.show-osd.name" = "Show OSD";
"permissions.show-osd.desc" = "This plugin can show OSD (On Screen Display) messages.";
"permissions.show-alert.name" = "Show Alerts";
"permissions.show-alert.desc" = "This plugin can show pop-up alerts.";
"permissions.video-overlay.name" = "Add overlays on videos";
"permissions.video-overlay.desc" = "This plugin can render additional content on the top of the video.";
"permissions.file-system.name" = "Access the file system";
"permissions.file-system.desc" = "This plugin can read or write files on your disk, which may include sensitive information. It can also execute other programs or applications that can harm your computer. So be sure to verify the source.";

"plugin.install" = "Install";
"plugin.installed" = "Installed";
"plugin.not_installed" = "Not Installed";
"plugin.local" = "Installed locally";
"alert.plugin.install_error" = "Error occurred during the installation: %@";
"alert.invalid_url" = "The URL is invalid.";
"plugin.install_error.invalid_url" = "The URL is invalid.";
"plugin.install_error.file_not_found" = "Cannot find the package file.";
"plugin.install_error.cannot_download" = "Failed to download the plugin.\n\nOutput:%@\n";
"plugin.install_error.cannot_unpackage" = "Failed to unpackage the plugin.\n\nOutput:%@\n";
"plugin.install_error.cannot_load" = "IINA cannot load this plugin. It might be in the wrong format.";
"plugin.check_for_updates" = "अद्यतन के लिए जाँच";
"plugin.updating" = "Downloading update…";
